UNNC-EEE-Group4/Project_SpeedGun/SpeedGun_MarkIII/SpeedGun_MarkIII.ioc
#MicroXplorer Configuration settings - do not modify
PB13.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD12.GPIO_Label=SEG16 [GH08172T_SEG16]
PA15\ (JTDI).GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate
PC10.GPIO_PuPd=GPIO_NOPULL
PE11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA10.GPIO_PuPd=GPIO_NOPULL
PC7.Locked=true
PA3.GPIO_PuPd=GPIO_PULLDOWN
PD8.Locked=true
SAI1.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
PE10.GPIO_PuPd=GPIO_NOPULL
PD10.GPIO_PuPd=GPIO_NOPULL
PA15\ (JTDI).Signal=LCD_SEG17
PD2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PB3\ (JTDO-TRACESWO).GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PA6.GPIO_Mode=GPIO_MODE_AF_PP
RCC.LPTIM1Freq_Value=80000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PE13.GPIO_Mode=GPIO_MODE_AF_PP
PD13.GPIO_Mode=GPIO_MODE_AF_PP
PD7.GPIO_PuPd=GPIO_NOPULL
PB13.GPIO_Mode=GPIO_MODE_AF_PP
RCC.APB2TimFreq_Value=80000000
PC4.GPIO_Mode=GPIO_MODE_AF_PP
PB6.Signal=GPXTI6
PC7.Signal=LCD_SEG25
PD8.Signal=LCD_SEG28
PE1.Signal=GPXTI1
PE14.Locked=true
RCC.USART3Freq_Value=80000000
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PA0.Locked=true
USB_OTG_FS.phy_itface=HCD_PHY_EMBEDDED
PA8.Locked=true
PC1.GPIO_PuPd=GPIO_NOPULL
PD1.GPIO_Label=MEMS_SCK [L3GD20_SCL/SPC]
PB12.GPIO_Label=SEG20 [GH08172T_SEG20]
ProjectManager.FirmwarePackage=STM32Cube FW_L4 V1.16.0
ProjectManager.BackupPrevious=false
PC4.GPIO_Label=SEG22 [GH08172T_SEG22]
PB1.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE9.Signal=SAI1_FS_B
PD1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE9.Locked=true
PB14.Mode=SEG14
PB1.GPIO_Label=SEG2 [GH08172T_SEG2]
PE4.GPIO_Label=SAI1_FS [CS43L22_LRCK]
PD14.GPIO_PuPd=GPIO_NOPULL
PA8.Signal=LCD_COM0
RCC.PLLRCLKFreq_Value=80000000
PE13.Mode=Single Bank
PE1.Locked=true
PB6.Locked=true
ProjectManager.HalAssertFull=false
PB2.GPIO_PuPd=GPIO_NOPULL
PA0.Signal=GPXTI0
PE9.GPIO_Mode=GPIO_MODE_AF_PP
PD15.Mode=SEG35
Mcu.Package=LQFP100
PE2.GPIO_Mode=GPIO_MODE_AF_PP
PB9.Signal=LCD_COM3
PB1.Signal=LCD_SEG6
PB14.GPIO_PuPd=GPIO_NOPULL
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
SH.GPXTI8.0=GPIO_EXTI8
PD12.Signal=LCD_SEG32
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
PA10.Signal=LCD_COM2
PB9.GPIO_PuPd=GPIO_NOPULL
PE12.GPIO_Label=QSPI_D0 [N25Q128A13EF840E_DQ0]
PE12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PC8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE8.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
RCC.PLLPoutputFreq_Value=22857142.85714286
RCC.APB1TimFreq_Value=80000000
RCC.LPUART1Freq_Value=80000000
PD5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
USB_OTG_FS.IPParameters=phy_itface,VirtualMode
PB13.Mode=SEG13
PE6.Locked=true
PD3.GPIO_PuPd=GPIO_NOPULL
PE6.GPIO_PuPd=GPIO_NOPULL
PA13\ (JTMS-SWDIO).GPIOParameters=GPIO_Label
PD5.Locked=true
PA4.GPIO_Label=MFX_WAKEUP [MFX_V2_WAKEUP]
PA8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD15.Signal=LCD_SEG35
PC8.GPIO_Mode=GPIO_MODE_AF_PP
PE12.Mode=Single Bank
PB5.GPIO_Mode=GPIO_MODE_AF_PP
PA6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.GPXTI10.0=GPIO_EXTI10
PD6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin80=VP_SYS_VS_Systick
Mcu.Pin81=VP_TIM3_VS_ClockSourceINT
ProjectManager.ProjectFileName=SpeedGun_MarkIII.ioc
Mcu.Pin79=PE1
Mcu.PinsNb=83
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
PC11.Locked=true
Mcu.Pin73=PB5
Mcu.Pin74=PB6
Mcu.Pin71=PB3 (JTDO-TRACESWO)
Mcu.Pin72=PB4 (NJTRST)
PC13.Locked=true
Mcu.Pin77=PB9
SAI1.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
Mcu.Pin78=PE0
Mcu.Pin75=PB7
PC13.Signal=GPXTI13
Mcu.Pin76=PB8
PD3.Signal=SPI2_MISO
Mcu.Pin70=PD7
PC2.Signal=GPIO_Input
Mcu.Pin68=PD5
Mcu.Pin69=PD6
PB14.Locked=true
PD6.Mode=Asynchronous
Mcu.Pin62=PC10
Mcu.Pin63=PC11
Mcu.Pin60=PA14 (JTCK-SWCLK)
USART2.BaudRate=2000000
Mcu.Pin61=PA15 (JTDI)
Mcu.Pin66=PD3
Mcu.Pin67=PD4
Mcu.Pin64=PD1
Mcu.Pin65=PD2
USB_HOST0.BSP.semaphore=
PC3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD10.Signal=LCD_SEG30
PB8.GPIO_Label=GYRO_INT2 [L3D20_DRDY/INT2]
PB10.GPIO_Mode=GPIO_MODE_AF_OD
PA8.GPIO_Label=COM0 [GH08172T_COM0]
Mcu.Pin59=PA13 (JTMS-SWDIO)
Mcu.Pin57=PA11
SH.GPXTI2.ConfNb=1
Mcu.Pin58=PA12
Mcu.Pin51=PC7
Mcu.Pin52=PC8
Mcu.Pin50=PC6
Mcu.Pin55=PA9
Mcu.Pin56=PA10
Mcu.Pin53=PC9
PE8.GPIO_Label=LED_GREEN
Mcu.Pin54=PA8
PB1.GPIO_Mode=GPIO_MODE_AF_PP
PB13.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB11.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
PB9.Locked=true
PA4.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
PD8.Mode=SEG28
Mcu.Pin48=PD14
Mcu.Pin49=PD15
RCC.PLLSAI1PoutputFreq_Value=13714285.714285715
Mcu.Pin46=PD12
Mcu.Pin47=PD13
SAI1.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
PB14.Signal=LCD_SEG14
RCC.PLLSAI2RoutputFreq_Value=16000000
PE2.GPIO_PuPd=GPIO_NOPULL
PA5.Signal=GPIO_Input
Mcu.Pin40=PB14
Mcu.Pin41=PB15
PE13.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin44=PD10
Mcu.Pin45=PD11
Mcu.Pin42=PD8
Mcu.Pin43=PD9
PE1.GPIO_Label=XL_INT [LSM303CTR_INT_XL]
PD1.Mode=Full_Duplex_Master
NVIC.TIM3_IRQn=true\:0\:0\:true\:false\:true\:true\:true
PB13.GPIO_PuPd=GPIO_NOPULL
PE14.Signal=QUADSPI_BK1_IO2
PE6.Mode=SAI_A_MasterWithClock
Mcu.Pin37=PB11
PB3\ (JTDO-TRACESWO).GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin38=PB12
Mcu.Pin35=PE15
PB15.GPIO_Label=SEG4 [GH08172T_SEG4]
RCC.I2C1Freq_Value=80000000
Mcu.Pin36=PB10
PD4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin39=PB13
Mcu.Pin30=PE10
PA1.GPIO_Label=JOY_LEFT
Mcu.Pin33=PE13
PC9.GPIO_PuPd=GPIO_NOPULL
PE3.GPIO_PuPd=GPIO_NOPULL
Mcu.Pin34=PE14
Mcu.Pin31=PE11
PA15\ (JTDI).GPIO_PuPd=GPIO_NOPULL
Mcu.Pin32=PE12
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PC10.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PC9.GPIOParameters=GPIO_Speed,PinState,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
Mcu.Pin26=PB2
Mcu.Pin27=PE7
Mcu.Pin24=PB0
Mcu.Pin25=PB1
Mcu.Pin28=PE8
PC7.GPIO_Label=SEG9 [GH08172T_SEG9]
Mcu.Pin29=PE9
PC8.Mode=SEG26
PC8.GPIO_PuPd=GPIO_NOPULL
PA13\ (JTMS-SWDIO).Mode=Serial_Wire
PD14.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin22=PC4
Mcu.Pin23=PC5
Mcu.Pin20=PA6
ADC1.master=1
Mcu.Pin21=PA7
PA3.Locked=true
PD10.Locked=true
PA5.GPIO_Label=JOY_DOWN
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
PB5.GPIO_PuPd=GPIO_NOPULL
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PE5.GPIO_Label=SAI1_SCK [CS43L22_SCLK]
PD15.Locked=true
ProjectManager.HeapSize=0x200
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PA1
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:true\:false
Mcu.Pin16=PA2
PB1.Mode=SEG6
Mcu.Pin13=PC3
Mcu.Pin14=PA0
Mcu.Pin19=PA5
Mcu.Pin17=PA3
Mcu.Pin18=PA4
PD8.GPIO_Speed=GPIO_SPEED_FREQ_LOW
USB_HOST.USBH_HandleTypeDef=hUsbHostFS
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_2
Mcu.Pin11=PC1
Mcu.Pin12=PC2
PC5.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE15.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin10=PC0
SH.GPXTI10.ConfNb=1
PE3.Signal=GPIO_Output
RCC.PWRFreq_Value=80000000
PB3\ (JTDO-TRACESWO).GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD2.Signal=GPXTI2
SH.GPXTI1.ConfNb=1
PD14.GPIO_Mode=GPIO_MODE_AF_PP
PB4\ (NJTRST).GPIO_PuPd=GPIO_NOPULL
Mcu.Family=STM32L4
ProjectManager.MainLocation=Core/Src
PA6.Mode=SEG3
ProjectManager.KeepUserCode=true
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PE11.GPIO_Label=QSPI_CS [N25Q128A13EF840E_S\#]
RCC.PLLSAI1RoutputFreq_Value=12000000
PC5.Locked=true
PB2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA7.GPIO_Mode=GPIO_MODE_AF_PP
PA0.GPIO_Label=JOY_CENTRE
PA12.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD9.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA11.Mode=Host_Only
PD6.Locked=true
PB4\ (NJTRST).GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD2.Locked=true
PC1.Locked=true
PB13.GPIO_Label=SEG3 [GH08172T_SEG3]
PD8.GPIO_PuPd=GPIO_NOPULL
PB15.Signal=LCD_SEG15
PD9.Mode=SEG29
PB3\ (JTDO-TRACESWO).Signal=GPIO_Output
PB5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.GPXTI2.0=GPIO_EXTI2
PD13.Signal=LCD_SEG33
Mcu.IP4=QUADSPI
Mcu.IP5=RCC
RCC.FCLKCortexFreq_Value=80000000
PD13.Locked=true
Mcu.IP2=LCD
Mcu.IP3=NVIC
PC11.GPIO_PuPd=GPIO_NOPULL
Mcu.IP0=ADC1
Mcu.IP1=I2C2
PE4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SAI1.VirtualMode-SAI_B_SyncSlave=VM_SLAVE
RCC.SDMMCFreq_Value=48000000
PE11.GPIO_PuPd=GPIO_NOPULL
PB1.GPIO_PuPd=GPIO_NOPULL
ProjectManager.PreviousToolchain=STM32CubeIDE
TIM3.Period=99
SH.ADCx_IN7.ConfNb=1
PA8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
USB_HOST0.BSP.ip=GPIO
PD4.GPIO_Mode=GPIO_MODE_AF_PP
PD5.Mode=Asynchronous
PA9.GPIO_Mode=GPIO_MODE_AF_PP
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PA4.GPIO_PuPd=GPIO_NOPULL
Mcu.IP10=USART2
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Mcu.IP12=USB_OTG_FS
PE13.GPIO_PuPd=GPIO_NOPULL
Mcu.IP11=USB_HOST
PC10.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
PC4.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA6.GPIO_PuPd=GPIO_NOPULL
RCC.VCOInputFreq_Value=4000000
PE8.Locked=true
PD14.Mode=SEG34
TIM3.Prescaler=39
PC11.GPIO_Label=OTG_FS_VBUS [EMIF02-USB03F2_Vbus]
PB5.Mode=SEG9
PC13.GPIO_PuPd=GPIO_NOPULL
PC7.GPIO_Mode=GPIO_MODE_AF_PP
PE3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE3.Locked=true
PB7.Signal=COMP2_INM
PA15\ (JTDI).GPIO_Mode=GPIO_MODE_AF_PP
PD10.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB6.GPIOParameters=GPIO_Label
PB0.Locked=true
PD6.GPIO_Mode=GPIO_MODE_AF_PP
PB4\ (NJTRST).Locked=true
PB12.GPIO_Mode=GPIO_MODE_AF_PP
PD13.GPIO_Label=SEG7 [GH08172T_SEG7]
PA6.Signal=LCD_SEG3
PB12.Mode=SEG12
PB0.GPIO_Mode=GPIO_MODE_AF_PP
PB15.GPIO_PuPd=GPIO_NOPULL
PD5.GPIO_Label=USART_TX
NVIC.OTG_FS_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.ToolChainLocation=
SH.GPXTI0.0=GPIO_EXTI0
PA10.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC14-OSC32_IN\ (PC14).Locked=true
USB_HOST0.BSP.name=Drive_VBUS_FS
SH.ADCx_IN1.0=ADC1_IN1
PB5.GPIO_Label=SEG12 [GH08172T_SEG12]
PE8.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PC5.Signal=LCD_SEG23
PD3.GPIO_Label=MEMS_MISO [L3GD20_SA0/SDO]
PE14.GPIO_Mode=GPIO_MODE_AF_PP
RCC.MSIAutoCalibration=DISABLED
PE7.Signal=SAI1_SD_B
PD6.Signal=USART2_RX
PE2.GPIO_Label=SAI1_MCK [CS43L22_MCLK]
PE12.Locked=true
PB9.GPIO_FM9=__NULL
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PA12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin82=VP_USB_HOST_VS_USB_HOST_CDC_FS
PB3\ (JTDO-TRACESWO).Locked=true
PB15.Locked=true
PA3.Signal=GPIO_Input
PE0.GPIO_PuPd=GPIO_NOPULL
RCC.MSI_VALUE=4000000
PA14\ (JTCK-SWCLK).Mode=Serial_Wire
PB4\ (NJTRST).GPIO_Mode=GPIO_MODE_AF_PP
USB_HOST.IPParameters=VirtualModeFS,USBH_HandleTypeDef
PE0.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PD15.GPIO_Label=SEG8 [GH08172T_SEG8]
PB8.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PE14.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA10.Mode=1/4 Duty Cycle
PC9.GPIO_Label=OTG_FS_PowerSwitchOn [STMPS2141STR_EN]
PC11.Signal=GPIO_Output
PC8.Signal=LCD_SEG26
USB_HOST0.BSP.solution=PC9
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=QSPI_D2 [N25Q128A13EF840E_DQ2]
PD9.Signal=LCD_SEG29
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
boardIOC=true
PA9.GPIO_PuPd=GPIO_NOPULL
PA12.GPIO_Label=OTG_FS_DP [EMIF02-USB03F2_D+out]
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
PD8.GPIO_Label=SEG18 [GH08172T_SEG18]
PE15.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PB9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode,GPIO_FM9
PB0.GPIO_Speed=GPIO_SPEED_FREQ_LOW
SH.GPXTI6.0=GPIO_EXTI6
PD4.GPIO_PuPd=GPIO_NOPULL
PA9.Mode=1/4 Duty Cycle
PB10.GPIO_Label=MFX_I2C_SLC [MFX_V2_I2C_SCL]
PA3.GPIO_Mode=GPIO_MODE_INPUT
PC5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PB9.Mode=1/4 Duty Cycle
SPI2.IPParameters=Mode,CalculateBaudRate,VirtualType,Direction,BaudRatePrescaler
PE2.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE0.Locked=true
RCC.USBFreq_Value=48000000
PD10.GPIO_Label=SEG17 [GH08172T_SEG17]
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PA1.Signal=GPIO_Input
PA7.GPIO_PuPd=GPIO_NOPULL
PE10.GPIO_Mode=GPIO_MODE_AF_PP
PH1-OSC_OUT\ (PH1).Locked=true
board=STM32L476G-DISCO
PD13.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.VCOOutputFreq_Value=160000000
PB15.Mode=SEG15
RCC.UART4Freq_Value=80000000
MxCube.Version=6.0.1
PA13\ (JTMS-SWDIO).GPIO_Label=SWDIO
PE5.Mode=SAI_A_MasterWithClock
PC9.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
RCC.PLLSAI1QoutputFreq_Value=48000000
RCC.ADCFreq_Value=12000000
PC1.GPIO_Label=MAG_INT [LSM303CTR_MAG_INT]
PA10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
VP_SYS_VS_Systick.Mode=SysTick
PE11.GPIO_Mode=GPIO_MODE_AF_PP
PD5.GPIO_PuPd=GPIO_PULLUP
PE5.Locked=true
PE14.GPIO_PuPd=GPIO_NOPULL
RCC.UART5Freq_Value=80000000
PA15\ (JTDI).GPIO_Label=SEG10 [GH08172T_SEG10]
RCC.IPParameters=ADCFreq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,MSIAutoCalibration,MSI_VALUE,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PLLSAI1N,PLLSAI1PoutputFreq_Value,PLLSAI1QoutputFreq_Value,PLLSAI1R,PLLSAI1RoutputFreq_Value,PLLSAI2PoutputFreq_Value,PLLSAI2RoutputFreq_Value,PWRFreq_Value,RNGFreq_Value,SAI1Freq_Value,SAI2Freq_Value,SDMMCFreq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAI1OutputFreq_Value,VCOSAI2OutputFreq_Value
ProjectManager.AskForMigrate=true
PE0.Signal=GPIO_Output
PE7.GPIO_Label=AUDIO_DIN [MP34DT01_DOUT]
PE12.Signal=QUADSPI_BK1_IO0
PE12.GPIO_Mode=GPIO_MODE_AF_PP
PB2.Locked=true
Mcu.IP8=SYS
Mcu.IP9=TIM3
Mcu.IP6=SAI1
Mcu.IP7=SPI2
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=80000000
VP_USB_HOST_VS_USB_HOST_CDC_FS.Signal=USB_HOST_VS_USB_HOST_CDC_FS
PA1.Locked=true
SH.GPXTI4.0=GPIO_EXTI4
RCC.PLLSAI2PoutputFreq_Value=4571428.571428572
KeepUserPlacement=false
VP_USB_HOST_VS_USB_HOST_CDC_FS.Mode=CDC_FS
PC14-OSC32_IN\ (PC14).Signal=RCC_OSC32_IN
NVIC.EXTI9_5_IRQn=true\:1\:0\:true\:false\:true\:true\:true
PB2.GPIO_Label=LED_RED
PE15.GPIO_PuPd=GPIO_NOPULL
SH.GPXTI4.ConfNb=1
PD11.Mode=SEG31
PC6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD3.GPIO_Mode=GPIO_MODE_AF_PP
RCC.HSI_VALUE=16000000
PA8.GPIO_PuPd=GPIO_NOPULL
RCC.PLLN=40
PE5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB7.Locked=true
PA9.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC8.Locked=true
PD9.Locked=true
PA5.GPIO_Mode=GPIO_MODE_INPUT
PD6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB14.GPIO_Mode=GPIO_MODE_AF_PP
PD7.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PB12.Signal=LCD_SEG12
PB0.GPIO_PuPd=GPIO_NOPULL
PE1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PA3.GPIO_Label=JOY_UP
PD6.GPIO_PuPd=GPIO_PULLUP
USB_HOST0.BSP.instance=PC9
PB4\ (NJTRST).Signal=LCD_SEG8
PA6.Locked=true
PA11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
NVIC.ADC1_2_IRQn=true\:2\:2\:true\:false\:true\:true\:true
PE15.GPIO_Mode=GPIO_MODE_AF_PP
PD1.GPIO_Mode=GPIO_MODE_AF_PP
RCC.USART1Freq_Value=80000000
PB15.GPIO_Mode=GPIO_MODE_AF_PP
PD15.GPIO_Mode=GPIO_MODE_AF_PP
PE14.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
SPI2.VirtualType=VM_MASTER
PB10.Mode=I2C
PA8.GPIO_Mode=GPIO_MODE_AF_PP
PB14.GPIO_Label=SEG19 [GH08172T_SEG19]
PE8.GPIO_PuPd=GPIO_NOPULL
PD3.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA13\ (JTMS-SWDIO).Locked=true
USB_HOST0.BSP.condition=
PC6.GPIO_Label=SEG14 [GH08172T_SEG14]
PC3.Locked=true
PA3.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PA6.GPIO_Label=SEG23 [GH08172T_SEG23]
PB6.GPIO_Label=COMP
PD4.Locked=true
PC5.Mode=SEG23
PB13.Signal=LCD_SEG13
PD3.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD6.GPIO_Label=USART_RX
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=SAI1_SD [CS43L22_SDIN]
PC3.GPIO_Speed=GPIO_SPEED_FREQ_LOW
RCC.MCO1PinFreq_Value=80000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
SH.GPXTI13.0=GPIO_EXTI13
PB11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA14\ (JTCK-SWCLK).Signal=SYS_JTCK-SWCLK
PD14.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA15\ (JTDI).Mode=SEG17
PD15.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE2.Mode=SAI_A_MasterWithClock
PD4.Signal=SPI2_MOSI
USB_HOST0.BSP.component=
PC3.Signal=LCD_VLCD
RCC.SAI2Freq_Value=13714285.714285715
PE5.Signal=SAI1_SCK_A
PE10.Locked=true
PA1.GPIO_PuPd=GPIO_PULLDOWN
PB13.Locked=true
PD2.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
PB2.Signal=GPIO_Output
PA4.Locked=true
PD1.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
MxDb.Version=DB.6.0.0
PB0.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE15.Locked=true
PE0.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PA1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.ADCx_IN1.ConfNb=1
PA5.GPIO_PuPd=GPIO_PULLDOWN
PD11.GPIO_Mode=GPIO_MODE_AF_PP
SPI2.CalculateBaudRate=40.0 MBits/s
PC11.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD5.GPIO_Mode=GPIO_MODE_AF_PP
PE2.Signal=SAI1_MCLK_A
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:true\:false
PD3.Mode=Full_Duplex_Master
PE10.Signal=QUADSPI_CLK
PC8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD11.Locked=true
PE10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.GPXTI8.ConfNb=1
PC6.GPIO_PuPd=GPIO_NOPULL
RCC.DFSDMFreq_Value=80000000
PA5.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
PB14.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC2.GPIO_Mode=GPIO_MODE_INPUT
PD4.Mode=Full_Duplex_Master
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:true\:false
