UNNC-EEE-Group4/Project_SpeedGun/SpeedGun_MarkIII/SpeedGun_MarkIII.ioc
PB10.GPIOParameters=GPIO_Speed,GPIO_PuPdOD,GPIO_Label,GPIO_Mode
PA6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB11.GPIO_Mode=GPIO_MODE_AF_OD
PA13\ (JTMS-SWDIO).Signal=SYS_JTMS-SWDIO
PA12.GPIO_PuPd=GPIO_NOPULL
PE10.GPIO_Label=QSPI_CLK [N25Q128A13EF840E_C]
PD9.GPIO_PuPd=GPIO_NOPULL
PB2.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
PE6.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PC6.GPIO_Speed=GPIO_SPEED_FREQ_LOW
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC4.Mode=SEG22
PE12.GPIO_PuPd=GPIO_NOPULL
PD8.GPIO_Mode=GPIO_MODE_AF_PP
RCC.PLLQoutputFreq_Value=80000000
PD9.GPIO_Label=SEG5 [GH08172T_SEG5]
PA1.GPIO_Mode=GPIO_MODE_INPUT
PD2.GPIO_PuPd=GPIO_NOPULL
PE11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
ADC1.IPParameters=Rank-1\#ChannelRegularConversion,master,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag
PA9.GPIO_Label=COM1 [GH08172T_COM1]
RCC.SWPMI1Freq_Value=80000000
PB10.GPIO_PuPdOD=GPIO_PULLUP
PB11.GPIO_PuPdOD=GPIO_PULLUP
PD9.GPIO_Mode=GPIO_MODE_AF_PP
PB8.GPIO_PuPd=GPIO_NOPULL
PE10.Mode=Single Bank
PC6.Signal=LCD_SEG24
PB11.GPIO_Label=MFX_I2C_SDA [MFX_V2_I2C_SDA]
PD13.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC9.PinState=GPIO_PIN_SET
PD7.Signal=GPIO_Output
SH.GPXTI0.ConfNb=1
PD1.Signal=SPI2_SCK
PA11.GPIO_Label=OTG_FS_DM [EMIF02-USB03F2_D-out]
PE1.GPIO_PuPd=GPIO_NOPULL
PD1.GPIO_PuPd=GPIO_NOPULL
PC0.Signal=ADCx_IN1
PC11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PB3\ (JTDO-TRACESWO).GPIO_PuPd=GPIO_NOPULL
PE0.GPIO_Speed=GPIO_SPEED_FREQ_LOW
USB_HOST0.BSP.STBoard=false
SH.GPXTI6.ConfNb=1
PA11.Locked=true
PB11.Mode=I2C
PB14.GPIO_Speed=GPIO_SPEED_FREQ_LOW
SH.ADCx_IN7.0=ADC1_IN7,IN7-Single-Ended
PC6.Mode=SEG24
PD11.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC6.Locked=true
PA9.Signal=LCD_COM1
PB5.Locked=true
PC7.GPIO_PuPd=GPIO_NOPULL
PD7.Locked=true
PE9.GPIO_Label=AUDIO_CLK [MP34DT01_CLK]
PB10.Signal=I2C2_SCL
PA15\ (JTDI).GPIO_Speed=GPIO_SPEED_FREQ_LOW
ProjectManager.LastFirmware=true
USB_HOST.VirtualModeFS=Cdc
PA7.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE15.Signal=QUADSPI_BK1_IO3
PE8.Signal=GPIO_Output
RCC.RNGFreq_Value=48000000
PC2.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
TIM3.IPParameters=Prescaler,Period,AutoReloadPreload,TIM_MasterOutputTrigger
PA9.Locked=true
PC6.GPIO_Mode=GPIO_MODE_AF_PP
PC11.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PB4\ (NJTRST).Mode=SEG8
PE7.Locked=true
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=80000000
ProjectManager.UnderRoot=true
PE4.GPIO_PuPd=GPIO_NOPULL
PE13.Locked=true
PA4.Signal=GPXTI4
ADC1.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_24CYCLES_5
PB5.Signal=LCD_SEG9
PE13.GPIO_Label=QSPI_D1 [N25Q128A13EF840E_DQ1]
PD12.Mode=SEG32
PA14\ (JTCK-SWCLK).Locked=true
PE3.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_PP
PE3.GPIO_Speed=GPIO_SPEED_FREQ_HIGH
PD11.Signal=LCD_SEG31
ProjectManager.CompilerOptimize=6
ADC1.Rank-1\#ChannelRegularConversion=1
PA11.Signal=USB_OTG_FS_DM
PC5.GPIO_Mode=GPIO_MODE_AF_PP
ProjectManager.ComputerToolchain=false
PC9.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PE2.Locked=true
PC3.GPIO_Label=VLCD
PA8.Mode=1/4 Duty Cycle
PB4\ (NJTRST).GPIO_Label=SEG11 [GH08172T_SEG11]
PE12.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PB12.GPIO_PuPd=GPIO_NOPULL
RCC.I2C2Freq_Value=80000000
PD1.Locked=true
PB0.Signal=LCD_SEG5
USB_HOST0.BSP.mode=Output
PA7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PC0.Locked=true
PC1.Signal=GPIO_Input
PB12.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD2.GPIO_Label=GYRO_INT1 [L3GD20_INT1]
PD7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PE15.Mode=Single Bank
PC3.Mode=1/4 Duty Cycle
SH.GPXTI1.0=GPIO_EXTI1
PC3.GPIO_Mode=GPIO_MODE_AF_PP
I2C2.IPParameters=Timing
PE7.GPIO_PuPd=GPIO_NOPULL
RCC.SAI1Freq_Value=13714285.714285715
RCC.CortexFreq_Value=80000000
Mcu.UserName=STM32L476VGTx
PB10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PD9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PH0-OSC_IN\ (PH0).Locked=true
PC10.Locked=true
PD15.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC10.Signal=GPXTI10
I2C2.Timing=0x10909CEC
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_I2C2_Init-I2C2-false-HAL-true,4-MX_LCD_Init-LCD-false-HAL-true,5-MX_QUADSPI_Init-QUADSPI-false-HAL-true,6-MX_SAI1_Init-SAI1-false-HAL-true,7-MX_SPI2_Init-SPI2-false-HAL-true,8-MX_USART2_UART_Init-USART2-false-HAL-true,9-MX_USB_HOST_Init-USB_HOST-false-HAL-false,10-MX_TIM3_Init-TIM3-false-HAL-true,11-MX_ADC1_Init-ADC1-false-HAL-true
PE9.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PC9.Locked=true
PB0.GPIO_Label=SEG21 [GH08172T_SEG21]
RCC.USART2Freq_Value=80000000
PA11.GPIO_PuPd=GPIO_NOPULL
PC13.GPIO_Label=MFX_IRQ_OUT [MFX_V2_IRQOUT]
PB11.Signal=I2C2_SDA
PE5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
ProjectManager.StackSize=0x400
RCC.I2C3Freq_Value=80000000
PD11.GPIO_PuPd=GPIO_NOPULL
PA12.Locked=true
PA12.Signal=USB_OTG_FS_DP
PB8.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
Mcu.UserConstants=
PE11.Mode=Single Bank
RCC.VCOSAI1OutputFreq_Value=96000000
PE5.GPIO_PuPd=GPIO_NOPULL
PC1.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_Mode
SH.GPXTI13.ConfNb=1
PA14\ (JTCK-SWCLK).GPIOParameters=GPIO_Label
Mcu.ThirdPartyNb=0
PD11.GPIO_Label=SEG6 [GH08172T_SEG6]
RCC.HCLKFreq_Value=80000000
Mcu.IPNb=13
PD8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD10.Mode=SEG30
Mcu.Pin6=PC14-OSC32_IN (PC14)
Mcu.Pin7=PC15-OSC32_OUT (PC15)
Mcu.Pin8=PH0-OSC_IN (PH0)
Mcu.Pin9=PH1-OSC_OUT (PH1)
RCC.AHBFreq_Value=80000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE4
Mcu.Pin3=PE5
PC1.GPIO_Mode=GPIO_MODE_INPUT
Mcu.Pin4=PE6
PD10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
Mcu.Pin5=PC13
USART2.VirtualMode-Asynchronous=VM_ASYNC
PD7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE13.Signal=QUADSPI_BK1_IO1
PE4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
File.Version=6
PA10.GPIO_Label=COM2 [GH08172T_COM2]
PB8.Locked=true
PE4.Mode=SAI_A_MasterWithClock
PE10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
USB_HOST0.BSP.i2creg=0
PE4.Signal=SAI1_FS_A
PE6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD12.GPIO_Mode=GPIO_MODE_AF_PP
ProjectManager.ProjectName=SpeedGun_MarkIII
PD7.GPIO_Label=GYRO_CS [L3GD20_CS_I2C/SPI]
USB_HOST0.BSP.i2caddr=0
PA7.Locked=true
PD14.Locked=true
PD15.GPIO_PuPd=GPIO_NOPULL
RCC.LSI_VALUE=32000
USB_OTG_FS.VirtualMode=Host_Only
ADC1.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
PE0.GPIO_Label=XL_CS [LSM303CTR_CS_XL]
PB9.GPIO_Speed=GPIO_SPEED_FREQ_LOW
SAI1.Synchro-SAI_B_SyncSlave=SAI_SYNCHRONOUS
PC4.Locked=true
SPI2.Direction=SPI_DIRECTION_2LINES
PC2.GPIO_Label=MAG_DRDY [LSM303CTR_DRDY_MAG]
RCC.PLLSAI1R=RCC_PLLR_DIV8
RCC.PLLSAI1N=24
PA2.Locked=true
PE8.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
PD12.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PA7.Mode=SEG4
PB9.GPIO_Label=COM3 [GH08172T_COM3]
PC10.GPIO_Label=OTG_FS_OverCurrent [STMPS2141STR_FAULT]
PE6.GPIO_Mode=GPIO_MODE_AF_PP
ProjectManager.NoMain=false
PC4.GPIO_PuPd=GPIO_NOPULL
PC4.Signal=LCD_SEG22
USB_HOST.BSP.number=1
PE5.GPIO_Mode=GPIO_MODE_AF_PP
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
PD5.Signal=USART2_TX
PA14\ (JTCK-SWCLK).GPIO_Label=SWCLK
PB3\ (JTDO-TRACESWO).GPIO_Label=M3V3_REG-ON
PE1.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
RCC.VCOSAI2OutputFreq_Value=32000000
PC5.GPIO_PuPd=GPIO_NOPULL
NVIC.USART2_IRQn=true\:2\:0\:true\:false\:true\:true\:true
PA10.GPIO_Mode=GPIO_MODE_AF_PP
PE9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PD12.Locked=true
PD10.GPIO_Mode=GPIO_MODE_AF_PP
PC8.GPIO_Label=SEG13 [GH08172T_SEG13]
PE4.GPIO_Mode=GPIO_MODE_AF_PP
PB4\ (NJTRST).GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE15.GPIO_Label=QSPI_D3 [N25Q128A13EF840E_DQ3]
PD12.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
ProjectManager.TargetToolchain=STM32CubeIDE
PE7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PB2.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultOutputPP
ADC1.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_7
PD13.Mode=SEG33
PE4.Locked=true
PC2.Locked=true
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
PE11.Signal=QUADSPI_NCS
RCC.LSE_VALUE=32768
PD3.Locked=true
PE7.GPIO_Mode=GPIO_MODE_AF_PP
PB12.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PB1.Locked=true
PB0.Mode=SEG5
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,Instance-SAI_B_SyncSlave,VirtualMode-SAI_B_SyncSlave,Synchro-SAI_B_SyncSlave,VirtualMode-SAI_A_MasterWithClock
PB9.GPIO_Mode=GPIO_MODE_AF_PP
PD11.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA12.GPIO_Mode=GPIO_MODE_AF_PP
RCC.APB2Freq_Value=80000000
USB_HOST0.BSP.api=Unknown
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PD4.GPIO_Label=MEMS_MOSI [L3GD20_SDA/SDI/SDO]
PE14.Mode=Single Bank
PB15.GPIO_Speed=GPIO_SPEED_FREQ_LOW
PD13.GPIO_PuPd=GPIO_NOPULL
PD14.GPIO_Label=SEG15 [GH08172T_SEG15]
PA4.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
PC2.GPIO_PuPd=GPIO_NOPULL
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PE11.Locked=true
Mcu.Name=STM32L476V(C-E-G)Tx
PA2.Signal=ADCx_IN7
PD14.Signal=LCD_SEG34
NVIC.EXTI0_IRQn=true\:2\:0\:true\:false\:true\:true\:true
PE7.Mode=SAI_B_SyncSlave
PA7.GPIO_Label=SEG0 [GH08172T_SEG0]
PA12.Mode=Host_Only
PC13.GPIO_ModeDefaultEXTI=GPIO_MODE_EVT_RISING
PC5.GPIO_Label=SEG1 [GH08172T_SEG1]
SAI1.Instance-SAI_B_SyncSlave=SAI$Index_Block_B
ADC1.NbrOfConversionFlag=1
PE13.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PB8.Signal=GPXTI8
PE3.GPIO_Label=AUDIO_RST [CS43L22_RESET]
PC9.Signal=GPIO_Output
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
PC7.Mode=SEG25
PA11.GPIO_Mode=GPIO_MODE_AF_PP
PA15\ (JTDI).Locked=true
RCC.APB1Freq_Value=80000000
PB11.Locked=true
ProjectManager.DeviceId=STM32L476VGTx
ProjectManager.LibraryCopy=1
PD12.GPIO_PuPd=GPIO_NOPULL
PC3.GPIO_PuPd=GPIO_NOPULL
PB1.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label,GPIO_Mode
PA7.Signal=LCD_SEG4
PE9.GPIO_PuPd=GPIO_NOPULL
